##  Group Sold Products By The Date Leetcode Task24

In [27]:
import pandas as pd
import numpy as np

In [158]:
data = [['2020-05-30', 'Headphone'], ['2020-06-01', 'Pencil'], ['2020-06-02', 'Mask'], ['2020-05-30', 'Basketball'], ['2020-06-01', 'Bible'], ['2020-06-02', 'Mask'], ['2020-05-30', 'T-Shirt']]
Activities = pd.DataFrame(data, columns=['sell_date', 'product']).astype({'sell_date':'datetime64[ns]', 'product':'object'})

In [115]:
Activities

   sell_date     product
0 2020-05-30   Headphone
1 2020-06-01      Pencil
2 2020-06-02        Mask
3 2020-05-30  Basketball
4 2020-06-01       Bible
5 2020-06-02        Mask
6 2020-05-30     T-Shirt

In [159]:
Activities=Activities.drop_duplicates().sort_values(by='product')
Activities

   sell_date     product
3 2020-05-30  Basketball
4 2020-06-01       Bible
0 2020-05-30   Headphone
2 2020-06-02        Mask
1 2020-06-01      Pencil
6 2020-05-30     T-Shirt

In [160]:
df2 = Activities.groupby('sell_date').count().reset_index()
df2.rename(columns={'product': 'num_sold'}, inplace=True)
df2

   sell_date  num_sold
0 2020-05-30         3
1 2020-06-01         2
2 2020-06-02         1

In [161]:
df3=Activities.groupby('sell_date')['product'].agg(','.join).reset_index()
df3

   sell_date                       product
0 2020-05-30  Basketball,Headphone,T-Shirt
1 2020-06-01                  Bible,Pencil
2 2020-06-02                          Mask

In [162]:
df2=df2.merge(df3 , on='sell_date')
df2.rename(columns={'product':'products'} , inplace=True)
df2

   sell_date  num_sold                      products
0 2020-05-30         3  Basketball,Headphone,T-Shirt
1 2020-06-01         2                  Bible,Pencil
2 2020-06-02         1                          Mask